In [1]:
import pandas as pd
import numpy as np
import sklearn as sk

In [2]:
D=pd.read_excel("https://data.hossam.kr/D03/ref_sample.xlsx", index_col="이름")
data=pd.DataFrame(D)

In [3]:
data.head(2)

      국어   영어    수학    과학
이름
철수  98.0   77  88.0  64.0
영희  88.0  120  62.0  72.0

### 결측치 확인

In [5]:
data.isna().sum()

국어    1
영어    0
수학    1
과학    2
dtype: int64

### 결측치 처리

#### 제거

> 행단위

In [6]:
data.dropna() #inplace=True 가능

      국어   영어    수학    과학
이름
철수  98.0   77  88.0  64.0
영희  88.0  120  62.0  72.0
수현  63.0   60  31.0  71.0
영호  80.0   88  91.0  72.0
석영  91.0   90  89.0  80.0

>열단위

In [8]:
data.dropna(axis=1)

     영어
이름
철수   77
영희  120
민철   70
수현   60
호영   50
영호   88
용식   88
나영   92
석영   90

### 대체하기

#### 고정값으로 대체

In [10]:
data.fillna(value=60)

      국어   영어    수학    과학
이름
철수  98.0   77  88.0  64.0
영희  88.0  120  62.0  72.0
민철  60.0   70  83.0  79.0
수현  63.0   60  31.0  71.0
호영  75.0   50  90.0  60.0
영호  80.0   88  91.0  72.0
용식  82.0   88  60.0  90.0
나영  90.0   92  81.0  60.0
석영  91.0   90  89.0  80.0

#### 통계값으로 대체

In [13]:
from sklearn.impute import SimpleImputer

In [16]:
# 직접할 수도 있지? 그럼그럼
ruls=SimpleImputer(missing_values=np.nan,strategy="mean") #strategy : mean, median, most_frequent

In [17]:
ruls.fit_transform(data.values)

array([[ 98.        ,  77.        ,  88.        ,  64.        ],
       [ 88.        , 120.        ,  62.        ,  72.        ],
       [ 83.375     ,  70.        ,  83.        ,  79.        ],
       [ 63.        ,  60.        ,  31.        ,  71.        ],
       [ 75.        ,  50.        ,  90.        ,  75.42857143],
       [ 80.        ,  88.        ,  91.        ,  72.        ],
       [ 82.        ,  88.        ,  76.875     ,  90.        ],
       [ 90.        ,  92.        ,  81.        ,  75.42857143],
       [ 91.        ,  90.        ,  89.        ,  80.        ]])

In [18]:
pd.DataFrame(ruls.fit_transform(data.values),columns=data.columns,index=data.index)

        국어     영어      수학         과학
이름
철수  98.000   77.0  88.000  64.000000
영희  88.000  120.0  62.000  72.000000
민철  83.375   70.0  83.000  79.000000
수현  63.000   60.0  31.000  71.000000
호영  75.000   50.0  90.000  75.428571
영호  80.000   88.0  91.000  72.000000
용식  82.000   88.0  76.875  90.000000
나영  90.000   92.0  81.000  75.428571
석영  91.000   90.0  89.000  80.000000